//*Задача 1 Створити функцію, яка приймає масив чисел і повертає новий масив, який містить тільки непарні числа.

//* Задача 2  Створити функцію, яка приймає масив об'єктів і повертає новий масив, який містить тільки об'єкти з певним значенням ключа.

//* Задача 3 Створити функцію, яка приймає масив об'єктів з ключами "name" та "age" і повертає новий масив, який містить тільки імена людей старших за 18 років.

//* Задача 4 Необхідно відобразити список товарів, відсортований за ціною в порядку зростання або спадання.Для цього можна використовувати метод sort() або reverse().

//* Задача 5 Необхідно відобразити список товарів, які відповідають певному критерію цін. Для цього можна використовувати метод filter (), потім дати на них знижку 10%.

//* Задача 6 Необхідно відображати список завдань, які можна відмітити як виконані або невиконані. Для цього можна використовувати метод map ().

//* Задача 7 Необхідно об'єднати два списки даних в один, для цього можна використовувати метод concat ().

//* Задача 8 Необхідно розбити текст на окремі слова для подальшої обробки. Для цього можна використовувати метод split ().

//* Задача 9 у нас є масив об'єктів, який містить інформацію про студентів, зокрема їх оцінки з різних предметів. Необхідно обчислити середній бал кожного студента і вивести його на екран.
