// Дефолтне значення праметрів функції.
// Напиши функцію greet(name), яка при викликові буде отримувати імя, отримуємо імя через prompt.
// Якщо імені в масиві немає, через alert виводимо повідомлення "Вітаємо, бажаєте стати нашим клієнтом?", якщо користувач тисне "ок" додаємо отримане імя в масив, та виводимо в алер повідомлення, "{імя}, ми раді, що ви з нами". Якщо користувач тисне "Скасувати", виводимо повідомлення, "Шкода, ми всеодно будемо чекати на тебе".
// Якщо клієнт є в списку, виводимо повідомлення в alert '{імя}, ми раді що ви повернулись'

let clients = ['сергій', 'олег', 'віталій', 'анатолій']; // масив для зберігання імен клієнтів

function greet(name) {
  // перевіряємо чи ім'я вже є в масиві
  if (clients.includes(name)) {
    alert(`${name}, ми раді що ви повернулись`);
  } else {
    // запитуємо користувача чи хоче він стати нашим клієнтом
    const confirmation = confirm('Вітаємо, бажаєте стати нашим клієнтом?');
    if (confirmation) {
      // додаємо ім'я до масиву клієнтів
      clients.push(name);
      alert(`${name}, ми раді, що ви з нами`);
    } else {
      alert('Шкода, ми всеодно будемо чекати на тебе');
    }
  }
  console.log(clients);
}

// викликаємо функцію та отримуємо ім'я від користувача через prompt
const name = prompt("Введіть своє ім'я");
greet(name);
