/*
 * Оператори порівняння
 */
//*! Коли нам потрібно щось порівняти ми використовуємо оператори порівняння. Зараз ми послідовно розглянемо всі 8 операторів. Але суть в тому, що який би із них ми не використовували, ми в завжди в кінцевому результаті отримаємо бульове значення true або false
//==   !=   === !==  >   <   >=     <=
// console.log(15 < 3);

/*
 * Приведення типів до числа
 */
// Зверніть увагу оператори порівняння завжди перетворюють свої операнди до числа.
// Розбираємо приклад
console.log('10' > 5);
// Відбувається перетворення рядка в число.Це одно і теж саме, якби ми написали так
// console.log(Number('10') > 5);
// console.log(Number(true) > 5); // true - дає 1, тому 1<5
// console.log(Number(false) > 5);// false - дає 0б тому також 0<5

/*
 * Оператори рівності (== і ===) і нерівності (!= і !==)
 * ✅ «ЗАВЖДИ ВИКОРИСТОВУЄМО СТРОГУ РІВНІСТЬ (===) ТА НЕРІВНІСТЬ (!==)
 * Чому? Тому, що такої необхідносі у вас швидше за все і не буду. В будь-кому випадку коли ви может їх використовувати ви зможете використовувати і оператори строгої рівності.
 * Використання строгої рівності гарантує більш вірне виконання коду
 */

const isEqual = 1 === true;
// const isEqual = 1 == true;
// const isEqual = 0 == true;

// console.log(isEqual);
