/*
 * Приведення до бульового значення на прикладі Boolean(value)
 */

// console.log(Boolean(0));

/*
 * Логічне І И (оператор &&)
 * - Зупиняється на брехні
 * - ПОвертає те, на чому зупинилось або останій операнд
 */

// console.log(5 && 4 && 7 && 'mango');

/*
 *  Логічне АБО (оператор ||)
 * - Зупиняється на правді
 * - Повертає те, на чому зупинилось або останій операнд
 */

// console.log(false || 5 || null || 0);

/*
 * Логічне НІ (оператор !)
 * Робить інверсію правда > брехня і брехня > правда
 */

console.log(!5);
const a = 3;
const b = -2;

// console.log(!(a > 0 || b > 0));
