/*
 * Напиши скрипт опрацювання покупки в магазині.
 *
 * - Баланс користувача зберігається в зміній balance
 * - Сума покупки зберігається в зміній payment
 *
 * - Перед перевіркою вивести повідомлення:
 * «Загальна вартість замовлення [число] кредитів. Повертаємо кількість доступних коштів на рахунку»
 *
 * - Якщо сума покупки не перевищує баланс:
 *    - Відняти з баланса суму покупки
 *    - Вивести повідомлення «На рахунку залишилось [число] кредитів
 * - Якщо сума покупки перевищує баланс:
 *    - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
 * - В кінці вивести повідомлення «Операція завершена»
 */

let balance = 10000;
const payment = 2000;

// 'Все добре знімаємо гроші... Дякуємо за покупку!'
