/*
 * Напиши скрипт опрацювання покупки в магазині.
 *
 * - Баланс користувача зберігається в зміній balance
 * - Сума покупки зберігається в зміній payment
 *
 * - Перед перевіркою вивести повідомлення:
 * «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість доступних коштів на рахунку»
 *
 * - Якщо сума покупки не перевищує баланс:
 *    - Відняти з баланса суму покупки
 *    - Вивести повідомлення «На рахунку залишилось [число] кредитів
 * - Якщо сума покупки перевищує баланс:
 *    - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
 * - В кінці вивести повідомлення «Операція завершена»
 */

let balance = 10000;
const payment = 20000;

console.log(`Загальна вартість замовлення ${payment} . Перевіряємо кількість доступних коштів на рахунку`);

if (payment <= balance) {
    balance -= payment
    console.log(`На рахунку залишилось ${balance} кредитів`);
} else {
    console.log(' «На рахунку недостатньо коштів для проведення операції!');
}

console.log('Операція завершена');





// 'Все добре знімаємо гроші... Дякуємо за покупку!'
