/*
 * Напиши скрипт підрахунку суми покупки із знижкою в залежності витраченої суми за весь час (партнерська програма).
 *
 * - Загальна сума витрачених коштів зберігається в зміній totalSpent
 * - Сума поточного платежу хберігається в зміній payment
 * - Знижка Зберігається в зміній discount
 *
 * - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
 * - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
 * - Якщо витрачено понад [5000 - золотий партнер, знижка 10%
 * - Якщо витрачено меньше 100 - не партнер, знижка 0%
 *
 * - В результаті вивести повідомлення
 * «Оформляємо замовлення на суму [сума] з знижкою [знижка]%»
 */

const totalSpent = 2000;
let payment = 500;
let discount = 0;

// 'Бронзовий партенр, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'
