/*
 * Напиши скрипт підрахунку суми покупки із знижкою в залежності витраченої суми за весь час (партнерська програма).
 *
 * - Загальна сума витрачених коштів зберігається в зміній totalSpent
 * - Сума поточного платежу зберігається в зміній payment
 * - Знижка Зберігається в зміній discount
 *
 * - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
 * - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
 * - Якщо витрачено понад [5000 - золотий партнер, знижка 10%
 * - Якщо витрачено меньше 100 - не партнер, знижка 0%
 *
 * - В результаті вивести повідомлення
 * «Оформляємо замовлення на суму [сума] з знижкою [знижка]%»
 */

const totalSpent = 50;
let payment = prompt("Яка сума покупки?");
let total = totalSpent + Number(payment)
let discount = 0;

if (payment === null) {
    alert("Операцію скасовано користувачем")
}
else if (total < 100) {
    alert(`Оформляємо замовлення на суму ${payment}.У вас немає знижки`)
} else if (total >= 100 && total < 1000) {
    discount = 0.02
    alert(`Оформляємо замовлення на суму ${payment}, ваша знижка 2%. Вартість покупки з врахуванням знижки ${payment - payment * discount}`)
} else if (total >= 1000 && total < 5000) {
    discount = 0.05
    alert(`Оформляємо замовлення на суму ${payment}, ваша знижка 5%. Вартість покупки з врахуванням знижки ${payment - payment * discount}`)
} else if (total >= 5000) {
    discount = 0.1
    alert(`Оформляємо замовлення на суму ${payment}, ваша знижка 10%. Вартість покупки з врахуванням знижки ${payment - payment * discount}`)
}












// 'Бронзовий партенр, знижка 2%'
// 'Срібний партнер, знижка 5%'
// 'Золотий партнер, знижка 10%'
// 'У вас ще немає партнерської знижки'
