// Задача 1
// Напишіть скрипт, який має наступні змінні літри та ціну за літр.

//  При покупці 2 або більше літрів надається знижка 5 центів за літр, при покупці 4 і більше літрів – 10 центів за літр, і так кожні два літри, до максимальної знижки 25 центів за літр. Але загальна знижка на літр не може перевищувати 25 центів. Поверніть загальну вартість, округлену до 2 знаків після коми. Також ви можете здогадатися, що від’ємних чи нечислових вводів не буде.

// Задача 2
// Напишіть код, який запитує логін за допомогою prompt.
// Якщо відвідувач вводить "Admin", тоді запропонуйте за допомогою prompt ввести пароль. Якщо введено порожній рядок або натиснуто Esc – показати “Скасовано”. Якщо введено інший рядок – тоді покажіть “Я вас не знаю”.
// Пароль перевіряється наступним чином:
// •	Якщо він дорівнює “Господар”, тоді покажіть “Ласкаво просимо!”,
// •	Інший рядок – покажіть “Неправильний пароль”,
// •	Для порожнього рядка, або якщо введення було скасовано, покажіть “Скасовано”.
