// Завдання 5
// Напиши скрипт управління особистим кабінетом інтернет банка.Ми маємо обʼєкт account в якому необхідно
// реалізувати методи для роботи з балансом та історією транзакцій.

// Типів транзакцій всього дві.
// Можна покласти кошти на рахунок або зняти з рахунку.

const Transaction = {
  DEPOSIT: 'deposit',
  WITHDRAW: 'withdraw',
};

//кожна транзакція це обʼєкт з властивостями: id, type та amount

const account = {
  //поточний баланс рахунку
  balance: 0,
  // історія транзакцій
  transaction: [],

  //метод створює та повертає обʼєкт транзакції.
  //Приймає суму та тип транзакції
  createTransaction(amount, type) {},

  //  Метод, який відповідає за додавання суми до балансу.
  //  Приймає суму транзакції.
  //  Викликає createTransaction для створення обʼєкта транзакцій
  //  після чого додає його в історію транзакцій
  deposit(amount) {},

  // Метод, який відповідає за зняття суми з баланса.
  // Приймає суму транзакцій.
  // Викликає createTransaction для створення обʼєкта транзакцій.
  // після чого додає його в історію транзакцій

  //Якщо amount більший ніж поточний баланс, виводе повідомлення про те, що зняти таку суму неможливо, недостатньо коштів на балансі
  withdraw(amount) {},

  //метод повертає поточний баланс.
  getBalance() {},

  //метод шукає та повертає обʼєкт транзакції по id
  getTransactionDetails(id) {},

  //Метод повертає кількоість коштів певного типу транзакції із всієї історії транзакій
  getTransactionTotal(type) {},
};
