// Дефолтне значення праметрів функції.
// Напиши функцію greet(name), яка при викликові буде отримувати імя, отримуємо імя через prompt.
// Якщо імені в масиві немає, через alert виводимо повідомлення "Вітаємо, бажаєте стати нашим клієнтом?", якщо користувач тисне "ок" додаємо отримане імя в масив, та виводимо в алерт повідомлення, "{імя}, ми раді, що ви з нами". Якщо користувач тисне "Скасувати", виводимо повідомлення, "Шкода, ми всеодно будемо чекати на тебе".
// *!Якщо клієнт є в списку, виводимо повідомлення в alert '{імя}, ми раді що ви повернулись'

let clients = ['сергій', 'олег', 'віталій', 'анатолій'];

// const greet = function (name) {

// }
function greet(name) {
  //перевірити чи імя є в масиві
  if (clients.includes(name)) {
    alert(`${name}, ми раді, що ви повернулись`);
  } else {
    //запитуємо користувача чи хоче він стати нашим клієнтом
    const confirmation = confirm('Вітаємо, бажаєте стати нашим клієнтом?');
    if (confirmation) {
      clients.push(name);
      alert(`${name}, ми раді, що ви з нами`);
    } else {
      alert('Шкода, ми всеодно будемо чекати на тебе');
    }
  }
  console.log(clients);
  return;
}

const name = prompt('Введіть своє імя');
greet(name);
