/*
 * Напиши скрипт опрацювання покупки в магазині.
 *
 * - Баланс користувача зберігається в змінній balance
 * - Сума покупки зберігається в змінній payment
 *
 * - Перед перевіркою вивести повідомлення:
 * «Загальна вартість замовлення [число] кредитів. Перевіряємо к-ть доступних коштів на рахунку»
 *
 * - Якщо сума покупки не перевищує баланс:
 *    - Відняти з баланса суму покупки
 *    - Вивести повідомлення «На рахунку залишилось [число] кредитів»
 * - Якщо сума покупки перевищує баланс:
 *    - Вивести повідомлення «На рахунку недостатньо коштів для проведення транзакції!»
 * - В кінці вивести повідомлення «Операцію завершено»
 */

//  1 вари
let balance = 10000;
const payment = 2000;

console.log(
  `Загальна вартість замовлення ${payment} кредитів. Перевіряєм к-ть доступних коштів на рахунку`,
);

if (payment <= balance) {
  balance -= payment;
  // balance = balance - payment

  console.log('Все добре, знімаємо гроші ... Дякуємо за покупку!');
  console.log(`На рахунку залишилось ${balance} кредитів`);
} else {
  console.log('На рахунку недостатньо коштів для проведення транзакції!');
}

console.log('Операцію завершено');
