/*
 * Напиши скрипт підрахунку суми покупки з знижкою в залежності
 * від витраченої суми за весь час (партнерська програма).
 *
 * - Загальна сума витрачених коштів зберігається в змінній totalSpent
 * - Сума поточного платежу зберігається в змінній payment
 * - Знижка зберігається в змінній discount
 *
 * - Якщо витрачено від [100 до 1000) - бронзовий партенр, знижка 2%
 * - Якщо витрачено від [1000 до 5000) - серебрянный партрёр, скидка 5%
 * - Якщо витрачено більше [5000 - золотой партрёр, скидка 10%
 * - Якщо витрачено менше 100) - не партнер, знижка 0%
 *
 * - В результаті вивести повідомлення
 * Оформляємо замовлення ана суму [сума] з знижкою [знижка]%»
 */

let totalSpent = 2000;
let payment = 500;
let discount = 0;


