// 1. Напишіть програму, яка перевірятиме, чи є число парним.

const number = 8;
if (number % 2 === 0) {
  console.log(`${number} парне`);
} else {
  console.log(`${number} не парне`);
}

// 2. Напишіть програму, яка перевірятиме, чи є число кратним трьом.
const number1 = 12;
if (number1 % 3 === 0) {
  console.log(`${number1} кратне 3`);
} else {
  console.log(`${number1} не кратне 3`);
}

// 5. Напишіть програму, яка обчислюватиме суму всіх чисел від 1 до заданого числа.
let sum = 0;
let number2 = 3;
for (let i = 1; i <= number2; i++) {
  sum += i;
}
console.log(sum);
// 6. Напишіть програму, яка перевірятиме, чи є число простим.
// 7. Напишіть програму, яка знаходить середнє арифметичне трьох чисел.
// 8. Напишіть програму, яка перевірятиме, чи є рік високосним.
// 9. Напишіть програму, яка перевірятиме, чи є число додатнім, від'ємним чи нулем.
// 10. Напишіть програму, яка перевірятиме, чи є символ голосним чи приголосним.
