// Створіть програму, яка запитує у користувача його настрій за допомогою prompt(), а потім в залежності від введеного настрою виводить на екран відповідний емодзі.

// Наприклад, якщо користувач вводить "щасливий", програма виводить на екран емодзі зі знаком усмішки 😊, якщо "сумний" - то емодзі зі сльозою 😢, якщо "злюсіль" - то емодзі з сердитим обличчям 😠 та ін.

// Для реалізації цієї задачі скористайся конструкцією switch.

let mood = prompt('What is your mood today?');

switch (mood) {
  case 'happy':
    console.log('😊');
    break;
  case 'sad':
    console.log('😢');
    break;
  case 'angry':
    console.log('😠');
    break;
  default:
    console.log('😐');
    break;
}
