//#1 Створіть об'єкт "автомобіль" з властивостями "модель", "рік випуску" та "швидкість". Додайте до об'єкту метод "прискорюватися", який збільшує швидкість автомобіля на вказану кількість км/год. Додайте до об'єкту метод "гальмувати", який зменшує швидкість автомобіля на вказану кількість км/год.

// Створіть масив "автомобілів", який міститиме кілька об'єктів типу "автомобіль". Використовуючи метод "forEach()", викличте метод "прискорюватися" на кожному елементі масиву "автомобілів". Використовуючи метод "filter()", створіть новий масив, який міститиме тільки ті об'єкти типу "автомобіль", які рік випуску більше вказаного значення. Використовуючи метод "map()", створіть новий масив, який містить швидкість кожного автомобіля з масиву "автомобілів". Виведіть цей масив в консоль.

// Використайте метод "call()", щоб викликати метод "гальмувати" на конкретному об'єкті "автомобіль". Передайте в метод "гальмувати" кількість км/год, на яку потрібно зменшити швидкість. Перевірте, що в контексті методу "гальмувати" значення "this" вказує на конкретний об'єкт "автомобіль".

//* Створіть об'єкт "автомобіль" з властивостями "модель", "рік випуску" та "швидкість":
const car = {
    model: 'Toyota',
    year: 2015,
    speed: 100,
    accelerate(speedChange) {
        this.speed += speedChange;
    },
    brake(speedChange) {
        this.speed -= speedChange;
    },
};

//* Створіть масив "автомобілів", який містить кілька об'єктів типу "автомобіль":
// const cars = [
//     { model: 'Audi', year: 2018, speed: 120 },
//     { model: 'BMW', year: 2020, speed: 150 },
//     { model: 'Mercedes', year: 2017, speed: 110 },
// ];

const cars = [
    { model: 'Mer', year: 2018, speed: 50 },
    { model: 'Toyota', year: 2015, speed: 100 },
    { model: 'Mercedes', year: 2017, speed: 110 },
];

//* Використовуючи метод "forEach()", викличте метод "прискорюватися" на кожному елементі масиву "автомобілів":

cars.concat(value => {
    car.accelerate.call(value, 20);
    car.brake.call(value, 20);
});

//* Використовуючи метод "filter()", створіть новий масив, який міститиме тільки ті об'єкти типу "автомобіль", які рік випуску більше вказаного значення:
const filteredCars = cars.filter(car => car.year > 2017);
console.table(filteredCars);

//* Використовуючи метод "map()", створіть новий масив, який містить швидкість кожного автомобіля з масиву "автомобілів":
const speeds = cars.map(car => car.speed);
console.log(speeds); // [120, 150, 110]

//* Використайте метод "call()", щоб викликати метод "гальмувати" на конкретному об'єкті "автомобіль". Передайте в метод "гальмувати" кількість км/год, на яку потрібно зменшити швидкість:
console.log(car.brake.call(car, 30));
console.log(car.speed); // 70
