//#1 Створіть об'єкт "покемон" з наступними властивостями:

// name (ім'я покемона)
// type (тип покемона)
// hp (здоров'я покемона)
// isKnockedOut (чи вбитий покемон, значення true/false)
// Створіть методи для цього об'єкту:

// logStatus: метод, який буде логувати інформацію про покемона (ім'я, тип, стан (живий/вбитий), та його здоров'я);
// knockOut: метод, який буде вбивати покемона (встановлює властивість isKnockedOut в значення true);
// wakeUp: метод, який буде оживляти покемона (встановлює властивість isKnockedOut в значення false).

const pokemon = {
    name: ' ',
    type: 'drago',
    hp: 9000,
    isKnockedOut: true ? 'живий' : 'вбитий',
    logStatus() {
        console.log(
            `${this.name} ${this.type} ${this.isKnockedOut} його здоровʼя ${this.hp},`,
        );
    },
    healthPokemon(health) {
        this.hp -= health;
        if (this.hp <= 0) {
            this.isKnockedOut = false ? 'живий' : 'мертвий';
            this.hp = 0;
        }
    },
};

pokemon.healthPokemon(1000);
pokemon.healthPokemon(1000);
pokemon.healthPokemon(3000);
pokemon.healthPokemon(4000);
pokemon.logStatus();

//#2 Створіть об'єкт "користувач" з властивостями "ім'я" та "вік". Додайте до об'єкту метод "вітатися", який буде повертати рядок з привітанням зі зазначенням імені користувача.

// Створіть масив "користувачів", який буде містити кілька об'єктів типу "користувач". Використовуючи метод "map()", створіть новий масив, який містить привітання з кожним користувачем з масиву "користувачів". Виведіть новий масив в консоль.

// Використайте метод "bind()", щоб створити нову функцію "прощатися", яка буде повертати рядок з прощанням зі зазначенням імені користувача. Викличте метод "прощатися" на об'єкті "користувач" та виведіть результат в консоль. Перевірте, що в контексті методу "прощатися" значення "this" вказує на об'єкт "користувач".
// Створюємо об'єкт "користувач"
let user = {
    name: 'John',
    age: 30,
    greet: function () {
        return 'Привіт, я ' + this.name + '!';
    },
};

// Створюємо масив "користувачів"
let users = [
    { name: 'Kate', age: 25 },
    { name: 'Tom', age: 40 },
    { name: 'Mary', age: 35 },
];

// Використовуючи метод "map()", створюємо новий масив з привітаннями
let greetings = users.map(function (user) {
    return 'Привіт, я ' + user.name + '!';
});

// Виводимо масив з привітаннями в консоль
console.log(greetings);

// Використовуючи метод "bind()", створюємо нову функцію "прощатися"
let goodbye = function () {
    return 'До побачення, ' + this.name + '!';
}.bind(user);

// Викликаємо метод "прощатися" та виводимо результат в консоль
console.log(goodbye());

// Перевіряємо, що в контексті методу "прощатися" значення "this" вказує на об'єкт "користувач"
console.log(goodbye.call(user)); // До побачення, John!
